import React from 'react';

class UserContract extends React.Component {
  render() {

    return (
      <p>
      <p style={{textAlign:'center'}}>柏君用户注册协议</p>
      <br/>
      <br/>
       
      
      一、服务条款的确认及接受
      1、柏君网站（指pc8g.com及其移动客户端软件、应用程序，以下称“本网站”）各项电子服务的所有权和运作权归属于深圳市柏君科技有限公司(以下称“柏君公司”)所有，本网站提供的服务将完全按照其发布的服务条款和操作规则严格执行。您确认所有服务条款并完成注册程序时，本协议在您与本网站间成立并发生法律效力，同时您成为本网站正式用户。
      2、根据国家法律法规变化及本网站运营需要，柏君公司有权对本协议条款及相关规则不时地进行修改，修改后的内容一旦以任何形式公布在本网站上即生效，并取代此前相关内容，您应不时关注本网站公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本网站；如您继续使用本网站，即视为知悉变动内容并同意接受。
      3、您点击“注册”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。
      <br/>
      <br/>
      
      二、服务须知
      1、基于本网站所提供的网络服务的重要性，您确认并同意：
      （1）提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新；
      （2）如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且柏君公司保留终止您使用本网站各项服务的权利。
      2、基于本网站所提供的网络服务的重要性，您确认并同意：
      （1）提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新；
      （2）如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且柏君公司保留终止您使用本网站各项服务的权利。

      <br/>
      <br/>
      三、订单
      1、使用本网站下订单，您应具备购买相关商品的权利能力和行为能力。在下订单的同时，即视为您满足上述条件，并对您在订单中提供的所有信息的真实性负责。
      2、在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与您本人不一致的，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任。
      3、您理解并同意：本网站上销售商展示的商品和价格等信息仅仅是要约邀请，您下单时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售商发出的合同要约；销售商收到您的订单信息后，只有在销售商将您在订单中订购的商品从仓库实际直接向您发出时（以商品出库为标志），方视为您与销售商之间就实际直接向您发出的商品建立了合同关系；如果您在一份订单里订购了多种商品并且销售商只给您发出了部分商品时，您与销售商之间仅就实际直接向您发出的商品建立了合同关系，只有在销售商实际直接向您发出了订单中订购的其他商品时，您和销售商之间就订单中其他已实际直接向您发出的商品才成立合同关系；对于电子书、数字音乐、在线手机充值等数字化商品，您下单并支付货款后合同即成立。当您作为消费者为生活消费需要下单并支付货款的情况下，您货款支付成功后即视为您与销售商之间就已支付货款部分的订单建立了合同关系。
      4、尽管销售商做出最大的努力，但由于市场变化及各种以合理商业努力难以控制因素的影响，本网站无法避免您提交的订单信息中的商品出现缺货、价格标示错误等情况；如您下单所购买的商品出现以上情况，您有权取消订单，销售商亦有权自行取消订单，若您已经付款，则为您办理退款。

      <br/>
      <br/>
      四、配送和交付
      1、您在本网站购买的商品将按照本网站上您所指定的送货地址进行配送。订单信息中列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。您应当清楚准确地填写您的送货地址、联系人及联系方式等配送信息，您知悉并确认，您所购买的商品应仅由您填写的联系人接受身份查验后接收商品，因您变更联系人或相关配送信息而造成的损失由您自行承担。
      2、因如下情况造成订单延迟或无法配送等，本网站将无法承担迟延配送或无法配送的责任：
      （1）客户提供错误信息和不详细的地址；
      （2）货物送达无人签收或拒收，由此造成的重复配送所产生的费用及相关的后果。
      （3）不可抗力，例如：自然灾害及恶劣天气、交通戒严等政府、司法机关的行为、决定或命令、意外交通事故、罢工、法规政策的修改、恐怖事件、抢劫、抢夺等暴力犯罪、突发战争等。
      3、您在本网站购买的商品由柏君公司的关联方或第三方配送公司（包括顺丰、圆通等，以下称“配送公司”）为您完成订单交付的，系统或单据记录的签收时间为交付时间；您购买的商品采用在线传输方式交付的，销售商向您指定系统发送的时间为交付时间；您购买服务的，生成的电子或者实物凭证中载明的时间为交付时间。

      <br/>
      <br/>
      五、用户个人信息保护及授权
      1、您知悉并同意，为方便您使用本网站相关服务，本网站将存储您在使用时的必要信息，包括但不限于您的真实姓名、性别、生日、配送地址、联系方式、通讯录、相册、日历、定位信息等。除法律法规规定的情形外，未经您的许可柏君公司不会向第三方公开、透露您的个人信息。柏君公司对相关信息采取专业加密存储与传输方式，利用合理措施保障用户个人信息的安全。
      2、您知悉并确认，您在注册帐号或使用本网站的过程中，需要提供真实的身份信息，柏君公司将根据国家法律法规相关要求，进行基于移动电话号码的真实身份信息认证。若您提供的信息不真实、不完整，则无法使用本网站或在使用过程中受到限制，同时，由此产生的不利后果，由您自行承担。
      3、您在使用本网站某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议；您使用前述特定服务，即视为您已阅读并同意接受相关单独协议。
      4、您充分理解并同意：
      （1）接收通过邮件、短信、电话等形式，向在本网站注册、购物的用户、收货人发送的订单信息、促销活动等内容；
      （2）为配合行政监管机关、司法机关执行工作，在法律规定范围内柏君公司有权向上述行政、司法机关提供您在使用本网站时所储存的相关信息，包括但不限于您的注册信息等，或使用相关信息进行证据保全，包括但不限于公证、见证等；
      （3）柏君公司依法保障您在安装或使用过程中的知情权和选择权，在您使用本网站服务过程中，涉及您设备自带功能的服务会提前征得您同意，您一经确认，柏君公司有权开启包括但不限于收集地理位置、读取通讯录、使用摄像头、启用录音等提供服务必要的辅助功能。
      （4）柏君公司有权根据实际情况，在法律规定范围内自行决定单个用户在本网站及服务中数据的最长储存期限以及用户日志的储存期限，并在服务器上为其分配数据最大存储空间等。

      <br/>
      <br/>
      六、违约责任
      1、如果柏君公司发现或收到他人举报投诉您违反本协议约定或存在任何恶意行为的，柏君公司有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁、注销等处罚，并公告处理结果。
      2、柏君公司有权依据合理判断对违反有关法律法规或本协议规定的行为采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，您应独自承担由此而产生的一切法律责任。
      3、您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；柏君公司因此遭受损失的，您也应当一并赔偿。
      4、除非另有明确的书面说明,柏君公司不对本网站的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。

      <br/>
      <br/>
      七、所有权及知识产权
      1、您一旦接受本协议，对于您提供、上传、创作、发布在本网站的文字、评论、图片、照片、视频、音频等任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等），您免费授予柏君公司及其关联公司至保护期终止为止、不可撤销的、全球范围的、排他的许可使用著作权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可许可使用的权利）、肖像权、用户ID名称等相关的全部合法权利权益，就柏君公司具有诉讼主体资格的权利、权益，柏君公司有权以自身名义对第三方侵权行为取证及提起诉讼。您同意柏君公司及其关联公司有权存储、使用、复制、修订、编辑、发布、展示、翻译、分发、推广、出版、发行、信息网络传播您以上信息内容，有权改编制作派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。
      2、柏君公司有权再许可给其他第三方第七条第一款的所有权利。
      3、您应确保在柏君公司网站上发表的第七条第一款各类信息内容均不涉及侵犯第三方肖像、隐私、知识产权或其他合法权益。否则柏君公司有权随时采取包括但不限于删除、断开链接等措施。
      4、本协议已经构成《中华人民共和国著作权法》第二十四条（条文序号依照2010年修订版《著作权法》确定）及相关法律规定的著作财产权等权利许可使用的书面协议，其效力及于您在本网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。
      5、您同意并已充分了解本协议的条款，承诺不将已发表于本网站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。
      6、除法律另有强制性规定外，未经柏君公司明确的特别书面同意,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本网站的信息内容，否则，柏君公司有权追究其法律责任。
      7、本网站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是柏君公司或其内容提供者的财产，受中国和国际版权法的保护。本网站上所有内容的汇编是柏君公司的排他财产，受中国和国际版权法的保护。本网站上所有软件都是柏君公司或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。

      <br/>
      <br/>
      八、法律管辖适用及其他
      1、本协议的订立、执行和解释及争议的解决均应适用中国法律。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，应向协议签订地有管辖权的人民法院提起诉讼。本协议签订地为中华人民共和国深圳市南山区。
      2、如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。
      3、本协议未明示授权的其他权利仍由柏君公司保留，您在行使这些权利时须另外取得柏君公司的书面许可。柏君公司如果未行使前述任何权利，并不构成对该权利的放弃。
      
      <br/>
      <br/>
      <p style={{textAlign:'center'}}>
      <button onClick={() => {window.history.go(-1);}}>返回</button>
      </p>
      </p>
    );
  }
}

export default UserContract;
